<?php

# Запускаємо буферизацію виводу, щоб контент не відправлявся одразу до клієнта.
ob_start();

# Встановлюємо назву для сесії. У цьому випадку ім'я сесії встановлено як "SID".
@session_name('SID');

# Стартуємо сесію. Символ "@" використовується для придушення потенційних попереджень.
@session_start();

# Отримуємо ідентифікатор поточної сесії.
$sessID = addslashes(session_id());

# Перевіряємо, чи відповідає ідентифікатор сесії шаблону (букви A-Z, цифри 0-9, довжина 32 символи).
if (!preg_match('#[A-z0-9]{32}#i', $sessID)) {
  # Якщо ідентифікатор не відповідає шаблону, створюємо новий, використовуючи MD5-хеш від випадкового числа.
  $sessID = md5(mt_rand(000000, 999999));
}